#Написать программу, реализующую теорему Пифагора.
# Входные данные можно указать прямо в файле с кодом:
a = 3 # значение первого катета
b = 4 # значение второго катета

c = a ** 2 + b ** 2# вычисляем гипотенузу  и сохранием её в переменную 'c'
print('Гипотенуза равна {}'.format(c))